manoj153/STM32F1BOARD/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM4_Init(void);                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void readChannel(uint8_t chWhat);
void trigger(void);
void buzz(uint32_t rounds);
void delayUS(uint32_t us);
/* Variables Start */
uint32_t dipSW 		= 0xFFFFFFFF;
uint32_t sensors 	=	0xFFFFFFFF;
_Bool inverted;
_Bool test;
_Bool CH1Rly, CH2Rly, CH3Rly, CH4Rly, CH5Rly, CH6Rly = 0x0;
/* Variables Ends*/
 void dipSWR(void);
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM4_Init();
	//HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1 );

  /* USER CODE BEGIN 2 */
	HAL_GPIO_WritePin(PWR_LED_GPIO_Port, PWR_LED_Pin, GPIO_PIN_SET);
	//4Beeps during on ~10Second
	for(int x = 0;x <2; x++)
  {
	buzz(1);
	HAL_Delay(250);
	buzz(1);
	HAL_Delay(250);
  }
	
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		CH1Rly = 0x0; CH2Rly = 0x0; CH3Rly = 0x0; CH4Rly = 0x0; CH5Rly = 0x0;  CH6Rly = 0x0;
		sensors 	=	0xFFFFFFFF;
		dipSWR();
		if (((dipSW >> 0) & 1))
		{
			inverted = 1;
		}
		else
		{
			inverted = 0;
		}
		
		if (((dipSW >> 1) & 1)) //CH6 BYP switch check to see to read the value or no
		{
			readChannel(6U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 3);
		sensors &= ~((0) << 2);
		sensors &= ~((0) << 1);
		sensors &= ~((0) << 0);		
		}
		else		
		{
		sensors &= ~((1) << 3);
		sensors &= ~((1) << 2);
		sensors &= ~((1) << 1);
		sensors &= ~((1) << 0);	
		}
		
		}
		
		if (((dipSW >> 2) & 1)) //CH5 BYP switch check to see to read the value or no
		{
			readChannel(5U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 7);
		sensors &= ~((0) << 6);
		sensors &= ~((0) << 5);
		sensors &= ~((0) << 4);	
		}
		else
		{
		sensors &= ~((1) << 7);
		sensors &= ~((1) << 6);
		sensors &= ~((1) << 5);
		sensors &= ~((1) << 4);	
		}
		}
		
		
		if (((dipSW >> 3) & 1)) //CH4 BYP switch check to see to read the value or no
		{
			readChannel(4U);
		}
		else 
		{
			if (inverted)
			{
		sensors &= ~((0) << 11);
		sensors &= ~((0) << 10);
		sensors &= ~((0) << 9);
		sensors &= ~((0) << 8);
			}
			else
			{
		sensors &= ~((1) << 11);
		sensors &= ~((1) << 10);
		sensors &= ~((1) << 9);
		sensors &= ~((1) << 8);
			}
				
		
		}
		
		if (((dipSW >> 4) & 1)) //CH3 BYP switch check to see to read the value or no
		{
			readChannel(3U);
		}
		else 
		{
				if (inverted)
				{
		sensors &= ~((0) << 15);
		sensors &= ~((0) << 14);
		sensors &= ~((0) << 13);
		sensors &= ~((0) << 12);
				}
				else 
				{
		sensors &= ~((1) << 15);
		sensors &= ~((1) << 14);
		sensors &= ~((1) << 13);
		sensors &= ~((1) << 12);
				}
		}
		
		if (((dipSW >> 5) & 1)) //CH2 BYP switch check to see to read the value or no
		{
			readChannel(2U);
		}
		else 
		{
		if (inverted)
		{			
		sensors &= ~((0) << 19);
		sensors &= ~((0) << 18);
		sensors &= ~((0) << 17);
		sensors &= ~((0) << 16);
		}
		else
		{
		sensors &= ~((1) << 19);
		sensors &= ~((1) << 18);
		sensors &= ~((1) << 17);
		sensors &= ~((1) << 16);
		}
		}
		
		if (((dipSW >> 6) & 1)) //CH1 BYP switch check to see to read the value or no
		{
			readChannel(1U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 23);
		sensors &= ~((0) << 22);
		sensors &= ~((0) << 21);
		sensors &= ~((0) << 20);
		}
		else
		{
		sensors &= ~((1) << 23);
		sensors &= ~((1) << 22);
		sensors &= ~((1) << 21);
		sensors &= ~((1) << 20);
		}
	}
		
		if (inverted)
		{
			sensors = (~sensors);
		}
		
		
		trigger();
		
  /* USER CODE END WHILE */

